//**************************************************************************
namespace MindTestLib
{
    /// <summary>
    /// Интерфейс любой геометрической фигуры
    /// </summary>
    public interface IFigure
    {
//-------------------------------------------------------------------------
        /// <summary>
        /// Метод вычисления площади любой геометрической фигуры
        /// </summary>
        /// <returns>Число - плозадь фигуры</returns>
        double CalculateArea();
    }
}
//--------------------------------------------------------------------------
